reports - 副本/benchmark/nvidia_h100/MiniMax-M2.5/test_05/01/128-1000-i4096-o2048/bench-test_05-128-1000-i4096-o2048.log
INFO 05-01 20:05:12 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 05-01 20:05:12 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fe1a39002c0>, trust_remote_code=True, seed=123, num_prompts=1000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=2048, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=128, model='/userdata/llms/MiniMax/MiniMax-M2.5', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='95,99', goodput=None, request_id_prefix='bench-d1b97d9f-', top_p=None, top_k=None, min_p=None, temperature=0.7, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='minimax-m2.5', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=30, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-01 20:05:13 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [2048, 2048]
Starting initial single prompt test run...
Waiting for endpoint to become up in 30 seconds

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:00 remaining
 |          | 00:15 elapsed, 168:16:18 remaining
Initial test run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 128

  0%|          | 0/1000 [00:00<?, ?it/s]
  0%|          | 1/1000 [00:41<11:30:09, 41.45s/it]
  0%|          | 2/1000 [00:42<4:56:01, 17.80s/it] 
  0%|          | 5/1000 [00:42<1:24:15,  5.08s/it]
  1%|          | 7/1000 [00:42<50:30,  3.05s/it]  
  1%|          | 9/1000 [00:43<32:23,  1.96s/it]
  1%|          | 11/1000 [00:43<21:38,  1.31s/it]
  1%|▏         | 13/1000 [00:43<14:53,  1.10it/s]
  2%|▏         | 15/1000 [00:43<10:30,  1.56it/s]
  2%|▏         | 17/1000 [00:43<07:35,  2.16it/s]
  2%|▏         | 19/1000 [00:43<05:36,  2.91it/s]
  2%|▏         | 21/1000 [00:44<04:16,  3.82it/s]
  2%|▏         | 23/1000 [00:44<03:20,  4.88it/s]
  2%|▎         | 25/1000 [00:44<02:41,  6.03it/s]
  3%|▎         | 27/1000 [00:44<02:15,  7.18it/s]
  3%|▎         | 29/1000 [00:44<01:56,  8.33it/s]
  3%|▎         | 31/1000 [00:44<01:43,  9.36it/s]
  3%|▎         | 33/1000 [00:44<01:34, 10.23it/s]
  4%|▎         | 35/1000 [00:45<01:27, 10.99it/s]
  4%|▎         | 37/1000 [00:45<01:23, 11.53it/s]
  4%|▍         | 39/1000 [00:45<01:20, 11.94it/s]
  4%|▍         | 41/1000 [00:45<01:17, 12.30it/s]
  4%|▍         | 43/1000 [00:45<01:16, 12.56it/s]
  4%|▍         | 45/1000 [00:45<01:15, 12.68it/s]
  5%|▍         | 47/1000 [00:46<01:16, 12.47it/s]
  5%|▍         | 49/1000 [00:46<01:13, 13.01it/s]
  5%|▌         | 51/1000 [00:46<01:12, 13.03it/s]
  5%|▌         | 53/1000 [00:46<01:12, 13.05it/s]
  6%|▌         | 55/1000 [00:46<01:12, 13.05it/s]
  6%|▌         | 57/1000 [00:46<01:12, 13.07it/s]
  6%|▌         | 59/1000 [00:46<01:12, 13.03it/s]
  6%|▌         | 61/1000 [00:47<01:11, 13.07it/s]
  6%|▋         | 63/1000 [00:47<01:11, 13.11it/s]
  6%|▋         | 64/1000 [01:04<01:11, 13.11it/s]
  6%|▋         | 65/1000 [01:24<1:27:05,  5.59s/it]
  7%|▋         | 66/1000 [01:25<1:15:06,  4.83s/it]
  7%|▋         | 68/1000 [01:25<50:07,  3.23s/it]  
  7%|▋         | 72/1000 [01:25<25:56,  1.68s/it]
  7%|▋         | 74/1000 [01:25<19:30,  1.26s/it]
  8%|▊         | 76/1000 [01:26<14:30,  1.06it/s]
  8%|▊         | 78/1000 [01:26<10:46,  1.43it/s]
  8%|▊         | 80/1000 [01:26<08:01,  1.91it/s]
  8%|▊         | 82/1000 [01:26<06:02,  2.53it/s]
  8%|▊         | 84/1000 [01:26<04:36,  3.32it/s]
  9%|▊         | 86/1000 [01:26<03:35,  4.24it/s]
  9%|▉         | 88/1000 [01:26<02:51,  5.32it/s]
  9%|▉         | 90/1000 [01:27<02:20,  6.46it/s]
  9%|▉         | 92/1000 [01:27<01:59,  7.62it/s]
  9%|▉         | 94/1000 [01:27<01:44,  8.71it/s]
 10%|▉         | 96/1000 [01:27<01:34,  9.59it/s]
 10%|▉         | 98/1000 [01:27<01:25, 10.54it/s]
 10%|█         | 100/1000 [01:27<01:20, 11.19it/s]
 10%|█         | 102/1000 [01:28<01:18, 11.38it/s]
 10%|█         | 104/1000 [01:28<01:13, 12.21it/s]
 11%|█         | 106/1000 [01:28<01:11, 12.43it/s]
 11%|█         | 108/1000 [01:28<01:10, 12.66it/s]
 11%|█         | 110/1000 [01:28<01:09, 12.78it/s]
 11%|█         | 112/1000 [01:28<01:09, 12.84it/s]
 11%|█▏        | 114/1000 [01:28<01:08, 12.98it/s]
 12%|█▏        | 116/1000 [01:29<01:08, 12.96it/s]
 12%|█▏        | 118/1000 [01:29<01:07, 12.98it/s]
 12%|█▏        | 120/1000 [01:29<01:07, 13.03it/s]
 12%|█▏        | 122/1000 [01:29<01:07, 13.00it/s]
 12%|█▏        | 124/1000 [01:29<01:07, 13.01it/s]
 13%|█▎        | 126/1000 [01:29<01:06, 13.16it/s]
 13%|█▎        | 128/1000 [01:30<01:06, 13.20it/s]
 13%|█▎        | 128/1000 [01:44<01:06, 13.20it/s]
 13%|█▎        | 129/1000 [02:06<1:34:43,  6.52s/it]
 13%|█▎        | 130/1000 [02:07<1:19:11,  5.46s/it]
 13%|█▎        | 132/1000 [02:07<50:27,  3.49s/it]  
 14%|█▎        | 135/1000 [02:08<28:34,  1.98s/it]
 14%|█▎        | 137/1000 [02:08<20:25,  1.42s/it]
 14%|█▍        | 139/1000 [02:08<14:40,  1.02s/it]
 14%|█▍        | 141/1000 [02:08<10:36,  1.35it/s]
 14%|█▍        | 143/1000 [02:08<07:45,  1.84it/s]
 14%|█▍        | 145/1000 [02:08<05:45,  2.48it/s]
 15%|█▍        | 147/1000 [02:09<04:20,  3.28it/s]
 15%|█▍        | 149/1000 [02:09<03:21,  4.23it/s]
 15%|█▌        | 151/1000 [02:09<02:40,  5.29it/s]
 15%|█▌        | 153/1000 [02:09<02:11,  6.45it/s]
 16%|█▌        | 155/1000 [02:09<01:50,  7.61it/s]
 16%|█▌        | 157/1000 [02:09<01:36,  8.70it/s]
 16%|█▌        | 159/1000 [02:10<01:27,  9.61it/s]
 16%|█▌        | 161/1000 [02:10<01:19, 10.50it/s]
 16%|█▋        | 163/1000 [02:10<01:14, 11.18it/s]
 16%|█▋        | 165/1000 [02:10<01:11, 11.65it/s]
 17%|█▋        | 167/1000 [02:10<01:08, 12.10it/s]
 17%|█▋        | 169/1000 [02:10<01:07, 12.38it/s]
 17%|█▋        | 171/1000 [02:10<01:06, 12.39it/s]
 17%|█▋        | 173/1000 [02:11<01:04, 12.79it/s]
 18%|█▊        | 175/1000 [02:11<01:04, 12.85it/s]
 18%|█▊        | 177/1000 [02:11<01:03, 12.90it/s]
 18%|█▊        | 179/1000 [02:11<01:03, 13.00it/s]
 18%|█▊        | 181/1000 [02:11<01:02, 13.03it/s]
 18%|█▊        | 183/1000 [02:11<01:02, 12.99it/s]
 18%|█▊        | 185/1000 [02:11<01:02, 13.03it/s]
 19%|█▊        | 187/1000 [02:12<01:02, 13.04it/s]
 19%|█▉        | 189/1000 [02:12<01:01, 13.12it/s]
 19%|█▉        | 191/1000 [02:12<01:01, 13.15it/s]
 19%|█▉        | 192/1000 [02:24<01:01, 13.15it/s]
 19%|█▉        | 193/1000 [02:49<1:15:54,  5.64s/it]
 19%|█▉        | 194/1000 [02:50<1:05:26,  4.87s/it]
 20%|█▉        | 196/1000 [02:51<43:39,  3.26s/it]  
 20%|█▉        | 198/1000 [02:51<29:50,  2.23s/it]
 20%|██        | 202/1000 [02:51<15:48,  1.19s/it]
 20%|██        | 204/1000 [02:51<12:00,  1.11it/s]
 21%|██        | 206/1000 [02:51<09:02,  1.46it/s]
 21%|██        | 208/1000 [02:51<06:48,  1.94it/s]
 21%|██        | 210/1000 [02:52<05:08,  2.56it/s]
 21%|██        | 212/1000 [02:52<03:56,  3.33it/s]
 21%|██▏       | 214/1000 [02:52<03:04,  4.26it/s]
 22%|██▏       | 216/1000 [02:52<02:27,  5.30it/s]
 22%|██▏       | 218/1000 [02:52<02:01,  6.45it/s]
 22%|██▏       | 220/1000 [02:52<01:42,  7.59it/s]
 22%|██▏       | 222/1000 [02:53<01:30,  8.63it/s]
 22%|██▏       | 224/1000 [02:53<01:20,  9.65it/s]
 23%|██▎       | 226/1000 [02:53<01:13, 10.49it/s]
 23%|██▎       | 228/1000 [02:53<01:09, 11.12it/s]
 23%|██▎       | 230/1000 [02:53<01:05, 11.68it/s]
 23%|██▎       | 232/1000 [02:53<01:03, 12.08it/s]
 23%|██▎       | 234/1000 [02:53<01:02, 12.30it/s]
 24%|██▎       | 236/1000 [02:54<01:00, 12.57it/s]
 24%|██▍       | 238/1000 [02:54<01:00, 12.69it/s]
 24%|██▍       | 240/1000 [02:54<00:59, 12.83it/s]
 24%|██▍       | 242/1000 [02:54<00:59, 12.72it/s]
 24%|██▍       | 244/1000 [02:54<00:57, 13.04it/s]
 25%|██▍       | 246/1000 [02:54<00:57, 13.05it/s]
 25%|██▍       | 248/1000 [02:55<00:57, 13.00it/s]
 25%|██▌       | 250/1000 [02:55<00:57, 13.03it/s]
 25%|██▌       | 252/1000 [02:55<00:56, 13.13it/s]
 25%|██▌       | 254/1000 [02:55<00:56, 13.17it/s]
 26%|██▌       | 256/1000 [02:55<00:56, 13.22it/s]
 26%|██▌       | 256/1000 [03:14<00:56, 13.22it/s]
 26%|██▌       | 257/1000 [03:32<1:21:56,  6.62s/it]
 26%|██▌       | 258/1000 [03:34<1:08:29,  5.54s/it]
 26%|██▌       | 260/1000 [03:34<43:37,  3.54s/it]  
 26%|██▌       | 262/1000 [03:34<28:57,  2.35s/it]
 26%|██▋       | 265/1000 [03:34<16:56,  1.38s/it]
 27%|██▋       | 267/1000 [03:34<12:18,  1.01s/it]
 27%|██▋       | 269/1000 [03:34<08:58,  1.36it/s]
 27%|██▋       | 271/1000 [03:34<06:36,  1.84it/s]
 27%|██▋       | 273/1000 [03:35<04:54,  2.47it/s]
 28%|██▊       | 275/1000 [03:35<03:42,  3.25it/s]
 28%|██▊       | 277/1000 [03:35<02:52,  4.19it/s]
 28%|██▊       | 279/1000 [03:35<02:16,  5.27it/s]
 28%|██▊       | 281/1000 [03:35<01:52,  6.41it/s]
 28%|██▊       | 283/1000 [03:35<01:35,  7.53it/s]
 28%|██▊       | 285/1000 [03:36<01:22,  8.67it/s]
 29%|██▊       | 287/1000 [03:36<01:14,  9.63it/s]
 29%|██▉       | 289/1000 [03:36<01:08, 10.42it/s]
 29%|██▉       | 291/1000 [03:36<01:03, 11.16it/s]
 29%|██▉       | 293/1000 [03:36<01:00, 11.65it/s]
 30%|██▉       | 295/1000 [03:36<00:58, 12.01it/s]
 30%|██▉       | 297/1000 [03:36<00:56, 12.34it/s]
 30%|██▉       | 299/1000 [03:37<00:55, 12.57it/s]
 30%|███       | 301/1000 [03:37<00:55, 12.65it/s]
 30%|███       | 303/1000 [03:37<00:54, 12.83it/s]
 30%|███       | 305/1000 [03:37<00:54, 12.84it/s]
 31%|███       | 307/1000 [03:37<00:53, 12.90it/s]
 31%|███       | 309/1000 [03:37<00:53, 13.00it/s]
 31%|███       | 311/1000 [03:38<00:52, 13.01it/s]
 31%|███▏      | 313/1000 [03:38<00:53, 12.82it/s]
 32%|███▏      | 315/1000 [03:38<00:51, 13.20it/s]
 32%|███▏      | 317/1000 [03:38<00:51, 13.21it/s]
 32%|███▏      | 319/1000 [03:38<00:51, 13.19it/s]
 32%|███▏      | 320/1000 [03:54<00:51, 13.19it/s]
 32%|███▏      | 321/1000 [04:15<1:02:51,  5.55s/it]
 32%|███▏      | 322/1000 [04:16<54:10,  4.79s/it]  
 32%|███▏      | 324/1000 [04:16<36:07,  3.21s/it]
 33%|███▎      | 326/1000 [04:16<24:40,  2.20s/it]
 33%|███▎      | 328/1000 [04:17<17:09,  1.53s/it]
 33%|███▎      | 332/1000 [04:17<09:16,  1.20it/s]
 33%|███▎      | 334/1000 [04:17<07:07,  1.56it/s]
 34%|███▎      | 336/1000 [04:17<05:26,  2.03it/s]
 34%|███▍      | 338/1000 [04:17<04:09,  2.65it/s]
 34%|███▍      | 340/1000 [04:17<03:12,  3.42it/s]
 34%|███▍      | 342/1000 [04:18<02:31,  4.34it/s]
 34%|███▍      | 344/1000 [04:18<02:01,  5.39it/s]
 35%|███▍      | 346/1000 [04:18<01:40,  6.51it/s]
 35%|███▍      | 348/1000 [04:18<01:25,  7.64it/s]
 35%|███▌      | 350/1000 [04:18<01:14,  8.75it/s]
 35%|███▌      | 352/1000 [04:18<01:06,  9.69it/s]
 35%|███▌      | 354/1000 [04:18<01:01, 10.47it/s]
 36%|███▌      | 356/1000 [04:19<00:57, 11.18it/s]
 36%|███▌      | 358/1000 [04:19<00:54, 11.69it/s]
 36%|███▌      | 360/1000 [04:19<00:53, 12.03it/s]
 36%|███▌      | 362/1000 [04:19<00:51, 12.37it/s]
 36%|███▋      | 364/1000 [04:19<00:50, 12.56it/s]
 37%|███▋      | 366/1000 [04:19<00:50, 12.67it/s]
 37%|███▋      | 368/1000 [04:20<00:49, 12.82it/s]
 37%|███▋      | 370/1000 [04:20<00:48, 12.89it/s]
 37%|███▋      | 372/1000 [04:20<00:48, 12.92it/s]
 37%|███▋      | 374/1000 [04:20<00:48, 12.99it/s]
 38%|███▊      | 376/1000 [04:20<00:47, 13.01it/s]
 38%|███▊      | 378/1000 [04:20<00:47, 13.03it/s]
 38%|███▊      | 380/1000 [04:20<00:47, 13.15it/s]
 38%|███▊      | 382/1000 [04:21<00:46, 13.18it/s]
 38%|███▊      | 384/1000 [04:21<00:47, 13.03it/s]
 38%|███▊      | 384/1000 [04:34<00:47, 13.03it/s]
 38%|███▊      | 385/1000 [04:57<1:06:51,  6.52s/it]
 39%|███▊      | 386/1000 [04:59<55:52,  5.46s/it]  
 39%|███▉      | 388/1000 [04:59<35:33,  3.49s/it]
 39%|███▉      | 390/1000 [04:59<23:36,  2.32s/it]
 39%|███▉      | 392/1000 [04:59<16:05,  1.59s/it]
 40%|███▉      | 395/1000 [04:59<09:38,  1.05it/s]
 40%|███▉      | 397/1000 [04:59<07:06,  1.41it/s]
 40%|███▉      | 399/1000 [05:00<05:16,  1.90it/s]
 40%|████      | 401/1000 [05:00<03:56,  2.53it/s]
 40%|████      | 403/1000 [05:00<03:00,  3.31it/s]
 40%|████      | 405/1000 [05:00<02:20,  4.24it/s]
 41%|████      | 407/1000 [05:00<01:51,  5.32it/s]
 41%|████      | 409/1000 [05:00<01:31,  6.47it/s]
 41%|████      | 411/1000 [05:00<01:17,  7.60it/s]
 41%|████▏     | 413/1000 [05:01<01:07,  8.70it/s]
 42%|████▏     | 415/1000 [05:01<01:00,  9.66it/s]
 42%|████▏     | 417/1000 [05:01<00:55, 10.44it/s]
 42%|████▏     | 419/1000 [05:01<00:52, 11.17it/s]
 42%|████▏     | 421/1000 [05:01<00:49, 11.65it/s]
 42%|████▏     | 423/1000 [05:01<00:48, 11.98it/s]
 42%|████▎     | 425/1000 [05:02<00:46, 12.34it/s]
 43%|████▎     | 427/1000 [05:02<00:45, 12.59it/s]
 43%|████▎     | 429/1000 [05:02<00:45, 12.67it/s]
 43%|████▎     | 431/1000 [05:02<00:44, 12.85it/s]
 43%|████▎     | 433/1000 [05:02<00:43, 12.91it/s]
 44%|████▎     | 435/1000 [05:02<00:43, 12.91it/s]
 44%|████▎     | 437/1000 [05:02<00:43, 13.01it/s]
 44%|████▍     | 439/1000 [05:03<00:43, 12.95it/s]
 44%|████▍     | 441/1000 [05:03<00:42, 13.06it/s]
 44%|████▍     | 443/1000 [05:03<00:42, 13.20it/s]
 44%|████▍     | 445/1000 [05:03<00:42, 13.20it/s]
 45%|████▍     | 447/1000 [05:03<00:42, 13.16it/s]
 45%|████▍     | 448/1000 [05:14<00:41, 13.16it/s]
 45%|████▍     | 449/1000 [05:40<51:47,  5.64s/it]
 45%|████▌     | 450/1000 [05:42<44:36,  4.87s/it]
 45%|████▌     | 452/1000 [05:42<29:42,  3.25s/it]
 45%|████▌     | 454/1000 [05:42<20:17,  2.23s/it]
 46%|████▌     | 456/1000 [05:42<14:04,  1.55s/it]
 46%|████▌     | 458/1000 [05:42<09:54,  1.10s/it]
 46%|████▌     | 462/1000 [05:43<05:27,  1.64it/s]
 46%|████▋     | 464/1000 [05:43<04:15,  2.10it/s]
 47%|████▋     | 466/1000 [05:43<03:17,  2.70it/s]
 47%|████▋     | 468/1000 [05:43<02:33,  3.45it/s]
 47%|████▋     | 470/1000 [05:43<02:01,  4.35it/s]
 47%|████▋     | 472/1000 [05:43<01:38,  5.39it/s]
 47%|████▋     | 474/1000 [05:44<01:20,  6.50it/s]
 48%|████▊     | 476/1000 [05:44<01:08,  7.60it/s]
 48%|████▊     | 478/1000 [05:44<00:59,  8.71it/s]
 48%|████▊     | 480/1000 [05:44<00:53,  9.67it/s]
 48%|████▊     | 482/1000 [05:44<00:49, 10.45it/s]
 48%|████▊     | 484/1000 [05:44<00:46, 11.15it/s]
 49%|████▊     | 486/1000 [05:44<00:44, 11.64it/s]
 49%|████▉     | 488/1000 [05:45<00:42, 11.99it/s]
 49%|████▉     | 490/1000 [05:45<00:41, 12.33it/s]
 49%|████▉     | 492/1000 [05:45<00:40, 12.54it/s]
 49%|████▉     | 494/1000 [05:45<00:39, 12.66it/s]
 50%|████▉     | 496/1000 [05:45<00:39, 12.82it/s]
 50%|████▉     | 498/1000 [05:45<00:39, 12.86it/s]
 50%|█████     | 500/1000 [05:46<00:38, 12.91it/s]
 50%|█████     | 502/1000 [05:46<00:38, 12.99it/s]
 50%|█████     | 504/1000 [05:46<00:38, 13.05it/s]
 51%|█████     | 506/1000 [05:46<00:37, 13.11it/s]
 51%|█████     | 508/1000 [05:46<00:37, 13.15it/s]
 51%|█████     | 510/1000 [05:46<00:37, 13.17it/s]
 51%|█████     | 512/1000 [05:46<00:37, 13.18it/s]
 51%|█████     | 512/1000 [06:04<00:37, 13.18it/s]
 51%|█████▏    | 513/1000 [06:24<53:39,  6.61s/it]
 51%|█████▏    | 514/1000 [06:25<44:50,  5.54s/it]
 52%|█████▏    | 516/1000 [06:25<28:30,  3.53s/it]
 52%|█████▏    | 518/1000 [06:25<18:54,  2.35s/it]
 52%|█████▏    | 520/1000 [06:25<12:52,  1.61s/it]
 52%|█████▏    | 522/1000 [06:25<08:57,  1.12s/it]
 52%|█████▎    | 525/1000 [06:26<05:28,  1.45it/s]
 53%|█████▎    | 527/1000 [06:26<04:06,  1.92it/s]
 53%|█████▎    | 529/1000 [06:26<03:05,  2.54it/s]
 53%|█████▎    | 531/1000 [06:26<02:21,  3.31it/s]
 53%|█████▎    | 533/1000 [06:26<01:50,  4.23it/s]
 54%|█████▎    | 535/1000 [06:26<01:27,  5.29it/s]
 54%|█████▎    | 537/1000 [06:27<01:12,  6.43it/s]
 54%|█████▍    | 539/1000 [06:27<01:00,  7.56it/s]
 54%|█████▍    | 541/1000 [06:27<00:52,  8.67it/s]
 54%|█████▍    | 543/1000 [06:27<00:47,  9.61it/s]
 55%|█████▍    | 545/1000 [06:27<00:43, 10.42it/s]
 55%|█████▍    | 547/1000 [06:27<00:40, 11.15it/s]
 55%|█████▍    | 549/1000 [06:28<00:38, 11.64it/s]
 55%|█████▌    | 551/1000 [06:28<00:37, 11.94it/s]
 55%|█████▌    | 553/1000 [06:28<00:36, 12.32it/s]
 56%|█████▌    | 555/1000 [06:28<00:35, 12.58it/s]
 56%|█████▌    | 557/1000 [06:28<00:35, 12.63it/s]
 56%|█████▌    | 559/1000 [06:28<00:34, 12.83it/s]
 56%|█████▌    | 561/1000 [06:28<00:34, 12.90it/s]
 56%|█████▋    | 563/1000 [06:29<00:33, 12.94it/s]
 56%|█████▋    | 565/1000 [06:29<00:33, 13.01it/s]
 57%|█████▋    | 567/1000 [06:29<00:33, 13.07it/s]
 57%|█████▋    | 569/1000 [06:29<00:32, 13.09it/s]
 57%|█████▋    | 571/1000 [06:29<00:32, 13.20it/s]
 57%|█████▋    | 573/1000 [06:29<00:32, 13.21it/s]
 57%|█████▊    | 575/1000 [06:29<00:32, 13.15it/s]
 58%|█████▊    | 576/1000 [06:44<00:32, 13.15it/s]
 58%|█████▊    | 577/1000 [07:06<39:10,  5.56s/it]
 58%|█████▊    | 578/1000 [07:07<33:44,  4.80s/it]
 58%|█████▊    | 580/1000 [07:08<22:27,  3.21s/it]
 58%|█████▊    | 582/1000 [07:08<15:18,  2.20s/it]
 58%|█████▊    | 584/1000 [07:08<10:37,  1.53s/it]
 59%|█████▊    | 586/1000 [07:08<07:28,  1.08s/it]
 59%|█████▉    | 588/1000 [07:08<05:20,  1.29it/s]
 59%|█████▉    | 592/1000 [07:09<03:00,  2.26it/s]
 59%|█████▉    | 594/1000 [07:09<02:22,  2.85it/s]
 60%|█████▉    | 596/1000 [07:09<01:52,  3.59it/s]
 60%|█████▉    | 598/1000 [07:09<01:29,  4.48it/s]
 60%|██████    | 600/1000 [07:09<01:13,  5.48it/s]
 60%|██████    | 602/1000 [07:09<01:00,  6.58it/s]
 60%|██████    | 604/1000 [07:09<00:51,  7.65it/s]
 61%|██████    | 606/1000 [07:10<00:44,  8.77it/s]
 61%|██████    | 608/1000 [07:10<00:40,  9.69it/s]
 61%|██████    | 610/1000 [07:10<00:37, 10.53it/s]
 61%|██████    | 612/1000 [07:10<00:34, 11.17it/s]
 61%|██████▏   | 614/1000 [07:10<00:33, 11.63it/s]
 62%|██████▏   | 616/1000 [07:10<00:31, 12.08it/s]
 62%|██████▏   | 618/1000 [07:10<00:30, 12.33it/s]
 62%|██████▏   | 620/1000 [07:11<00:30, 12.49it/s]
 62%|██████▏   | 622/1000 [07:11<00:29, 12.72it/s]
 62%|██████▏   | 624/1000 [07:11<00:29, 12.83it/s]
 63%|██████▎   | 626/1000 [07:11<00:29, 12.89it/s]
 63%|██████▎   | 628/1000 [07:11<00:28, 12.96it/s]
 63%|██████▎   | 630/1000 [07:11<00:28, 13.04it/s]
 63%|██████▎   | 632/1000 [07:12<00:28, 13.10it/s]
 63%|██████▎   | 634/1000 [07:12<00:27, 13.17it/s]
 64%|██████▎   | 636/1000 [07:12<00:27, 13.09it/s]
 64%|██████▍   | 638/1000 [07:12<00:27, 13.16it/s]
 64%|██████▍   | 640/1000 [07:12<00:27, 13.21it/s]
 64%|██████▍   | 640/1000 [07:24<00:27, 13.21it/s]
 64%|██████▍   | 641/1000 [07:49<38:49,  6.49s/it]
 64%|██████▍   | 642/1000 [07:50<32:24,  5.43s/it]
 64%|██████▍   | 644/1000 [07:50<20:35,  3.47s/it]
 65%|██████▍   | 646/1000 [07:50<13:37,  2.31s/it]
 65%|██████▍   | 648/1000 [07:50<09:16,  1.58s/it]
 65%|██████▌   | 650/1000 [07:50<06:26,  1.11s/it]
 65%|██████▌   | 652/1000 [07:51<04:33,  1.27it/s]
 66%|██████▌   | 655/1000 [07:51<02:50,  2.02it/s]
 66%|██████▌   | 657/1000 [07:51<02:09,  2.64it/s]
 66%|██████▌   | 659/1000 [07:51<01:40,  3.40it/s]
 66%|██████▌   | 661/1000 [07:51<01:18,  4.33it/s]
 66%|██████▋   | 663/1000 [07:51<01:02,  5.38it/s]
 66%|██████▋   | 665/1000 [07:52<00:52,  6.44it/s]
 67%|██████▋   | 667/1000 [07:52<00:43,  7.66it/s]
 67%|██████▋   | 669/1000 [07:52<00:37,  8.73it/s]
 67%|██████▋   | 671/1000 [07:52<00:34,  9.66it/s]
 67%|██████▋   | 673/1000 [07:52<00:31, 10.51it/s]
 68%|██████▊   | 675/1000 [07:52<00:29, 11.16it/s]
 68%|██████▊   | 677/1000 [07:53<00:27, 11.59it/s]
 68%|██████▊   | 679/1000 [07:53<00:26, 12.06it/s]
 68%|██████▊   | 681/1000 [07:53<00:25, 12.35it/s]
 68%|██████▊   | 683/1000 [07:53<00:25, 12.53it/s]
 68%|██████▊   | 685/1000 [07:53<00:24, 12.71it/s]
 69%|██████▊   | 687/1000 [07:53<00:24, 12.84it/s]
 69%|██████▉   | 689/1000 [07:53<00:24, 12.84it/s]
 69%|██████▉   | 691/1000 [07:54<00:23, 12.91it/s]
 69%|██████▉   | 693/1000 [07:54<00:23, 13.09it/s]
 70%|██████▉   | 695/1000 [07:54<00:23, 13.11it/s]
 70%|██████▉   | 697/1000 [07:54<00:22, 13.18it/s]
 70%|██████▉   | 699/1000 [07:54<00:21, 14.09it/s]
 70%|███████   | 701/1000 [07:54<00:21, 13.89it/s]
 70%|███████   | 703/1000 [07:54<00:21, 13.59it/s]
 70%|███████   | 704/1000 [08:14<00:21, 13.59it/s]
 70%|███████   | 705/1000 [08:32<27:47,  5.65s/it]
 71%|███████   | 706/1000 [08:33<23:54,  4.88s/it]
 71%|███████   | 708/1000 [08:33<15:52,  3.26s/it]
 71%|███████   | 710/1000 [08:33<10:48,  2.24s/it]
 71%|███████   | 712/1000 [08:34<07:28,  1.56s/it]
 71%|███████▏  | 714/1000 [08:34<05:14,  1.10s/it]
 72%|███████▏  | 716/1000 [08:34<03:44,  1.27it/s]
 72%|███████▏  | 718/1000 [08:34<02:42,  1.73it/s]
 72%|███████▏  | 722/1000 [08:34<01:33,  2.97it/s]
 72%|███████▏  | 724/1000 [08:35<01:14,  3.68it/s]
 73%|███████▎  | 726/1000 [08:35<01:00,  4.54it/s]
 73%|███████▎  | 728/1000 [08:35<00:49,  5.51it/s]
 73%|███████▎  | 730/1000 [08:35<00:40,  6.60it/s]
 73%|███████▎  | 732/1000 [08:35<00:34,  7.68it/s]
 73%|███████▎  | 734/1000 [08:35<00:30,  8.70it/s]
 74%|███████▎  | 736/1000 [08:35<00:27,  9.66it/s]
 74%|███████▍  | 738/1000 [08:36<00:25, 10.47it/s]
 74%|███████▍  | 740/1000 [08:36<00:23, 10.93it/s]
 74%|███████▍  | 742/1000 [08:36<00:22, 11.67it/s]
 74%|███████▍  | 744/1000 [08:36<00:21, 12.09it/s]
 75%|███████▍  | 746/1000 [08:36<00:20, 12.32it/s]
 75%|███████▍  | 748/1000 [08:36<00:20, 12.56it/s]
 75%|███████▌  | 750/1000 [08:36<00:19, 12.71it/s]
 75%|███████▌  | 752/1000 [08:37<00:19, 12.76it/s]
 75%|███████▌  | 754/1000 [08:37<00:19, 12.90it/s]
 76%|███████▌  | 756/1000 [08:37<00:18, 13.03it/s]
 76%|███████▌  | 758/1000 [08:37<00:18, 13.01it/s]
 76%|███████▌  | 761/1000 [08:37<00:15, 15.07it/s]
 76%|███████▋  | 763/1000 [08:37<00:16, 14.53it/s]
 76%|███████▋  | 765/1000 [08:38<00:16, 14.15it/s]
 77%|███████▋  | 767/1000 [08:38<00:16, 13.84it/s]
 77%|███████▋  | 768/1000 [08:54<00:16, 13.84it/s]
 77%|███████▋  | 769/1000 [09:14<20:15,  5.26s/it]
 77%|███████▋  | 770/1000 [09:15<17:31,  4.57s/it]
 77%|███████▋  | 772/1000 [09:15<11:43,  3.09s/it]
 77%|███████▋  | 774/1000 [09:15<08:01,  2.13s/it]
 78%|███████▊  | 776/1000 [09:15<05:33,  1.49s/it]
 78%|███████▊  | 778/1000 [09:16<03:54,  1.06s/it]
 78%|███████▊  | 780/1000 [09:16<02:47,  1.31it/s]
 78%|███████▊  | 782/1000 [09:16<02:01,  1.80it/s]
 78%|███████▊  | 785/1000 [09:16<01:17,  2.77it/s]
 79%|███████▊  | 787/1000 [09:16<01:00,  3.53it/s]
 79%|███████▉  | 789/1000 [09:16<00:47,  4.43it/s]
 79%|███████▉  | 791/1000 [09:17<00:38,  5.48it/s]
 79%|███████▉  | 793/1000 [09:17<00:31,  6.58it/s]
 80%|███████▉  | 795/1000 [09:17<00:26,  7.68it/s]
 80%|███████▉  | 797/1000 [09:17<00:23,  8.77it/s]
 80%|███████▉  | 799/1000 [09:17<00:20,  9.69it/s]
 80%|████████  | 801/1000 [09:17<00:18, 10.48it/s]
 80%|████████  | 803/1000 [09:18<00:17, 11.15it/s]
 80%|████████  | 805/1000 [09:18<00:16, 11.65it/s]
 81%|████████  | 807/1000 [09:18<00:16, 11.99it/s]
 81%|████████  | 809/1000 [09:18<00:15, 12.35it/s]
 81%|████████  | 811/1000 [09:18<00:15, 12.56it/s]
 81%|████████▏ | 813/1000 [09:18<00:14, 12.49it/s]
 82%|████████▏ | 815/1000 [09:18<00:14, 12.90it/s]
 82%|████████▏ | 817/1000 [09:19<00:14, 12.94it/s]
 82%|████████▏ | 819/1000 [09:19<00:13, 12.97it/s]
 82%|████████▏ | 821/1000 [09:19<00:13, 13.02it/s]
 82%|████████▏ | 823/1000 [09:19<00:13, 13.08it/s]
 82%|████████▎ | 825/1000 [09:19<00:13, 13.12it/s]
 83%|████████▎ | 827/1000 [09:19<00:13, 13.20it/s]
 83%|████████▎ | 829/1000 [09:19<00:12, 13.21it/s]
 83%|████████▎ | 831/1000 [09:20<00:12, 13.15it/s]
 83%|████████▎ | 832/1000 [09:34<00:12, 13.15it/s]
 83%|████████▎ | 833/1000 [09:57<15:39,  5.63s/it]
 83%|████████▎ | 834/1000 [09:58<13:26,  4.86s/it]
 84%|████████▎ | 836/1000 [09:58<08:52,  3.25s/it]
 84%|████████▍ | 838/1000 [09:58<06:00,  2.23s/it]
 84%|████████▍ | 840/1000 [09:59<04:08,  1.55s/it]
 84%|████████▍ | 842/1000 [09:59<02:53,  1.10s/it]
 84%|████████▍ | 844/1000 [09:59<02:02,  1.27it/s]
 85%|████████▍ | 846/1000 [09:59<01:28,  1.74it/s]
 85%|████████▍ | 848/1000 [09:59<01:05,  2.34it/s]
 85%|████████▌ | 852/1000 [10:00<00:38,  3.89it/s]
 85%|████████▌ | 854/1000 [10:00<00:31,  4.71it/s]
 86%|████████▌ | 856/1000 [10:00<00:25,  5.65it/s]
 86%|████████▌ | 858/1000 [10:00<00:21,  6.70it/s]
 86%|████████▌ | 860/1000 [10:00<00:18,  7.76it/s]
 86%|████████▌ | 862/1000 [10:00<00:15,  8.74it/s]
 86%|████████▋ | 864/1000 [10:00<00:14,  9.70it/s]
 87%|████████▋ | 866/1000 [10:01<00:12, 10.47it/s]
 87%|████████▋ | 868/1000 [10:01<00:11, 11.11it/s]
 87%|████████▋ | 870/1000 [10:01<00:11, 11.58it/s]
 87%|████████▋ | 872/1000 [10:01<00:10, 12.04it/s]
 87%|████████▋ | 874/1000 [10:01<00:10, 12.33it/s]
 88%|████████▊ | 876/1000 [10:01<00:09, 12.53it/s]
 88%|████████▊ | 878/1000 [10:02<00:09, 12.71it/s]
 88%|████████▊ | 880/1000 [10:02<00:09, 12.81it/s]
 88%|████████▊ | 882/1000 [10:02<00:09, 12.91it/s]
 88%|████████▊ | 884/1000 [10:02<00:08, 13.01it/s]
 89%|████████▊ | 886/1000 [10:02<00:08, 13.05it/s]
 89%|████████▉ | 888/1000 [10:02<00:08, 13.14it/s]
 89%|████████▉ | 890/1000 [10:02<00:08, 13.17it/s]
 89%|████████▉ | 892/1000 [10:03<00:08, 13.14it/s]
 89%|████████▉ | 894/1000 [10:03<00:08, 13.11it/s]
 90%|████████▉ | 896/1000 [10:03<00:07, 13.19it/s]
 90%|████████▉ | 896/1000 [10:14<00:07, 13.19it/s]
 90%|████████▉ | 897/1000 [10:40<11:15,  6.56s/it]
 90%|████████▉ | 898/1000 [10:41<09:20,  5.49s/it]
 90%|█████████ | 900/1000 [10:41<05:50,  3.51s/it]
 90%|█████████ | 902/1000 [10:41<03:48,  2.34s/it]
 90%|█████████ | 904/1000 [10:41<02:33,  1.60s/it]
 91%|█████████ | 906/1000 [10:42<01:44,  1.12s/it]
 91%|█████████ | 908/1000 [10:42<01:13,  1.26it/s]
 91%|█████████ | 910/1000 [10:42<00:51,  1.73it/s]
 91%|█████████ | 912/1000 [10:42<00:37,  2.34it/s]
 92%|█████████▏| 915/1000 [10:42<00:24,  3.54it/s]
 92%|█████████▏| 917/1000 [10:42<00:18,  4.42it/s]
 92%|█████████▏| 919/1000 [10:43<00:14,  5.41it/s]
 92%|█████████▏| 921/1000 [10:43<00:12,  6.52it/s]
 92%|█████████▏| 923/1000 [10:43<00:10,  7.63it/s]
 92%|█████████▎| 925/1000 [10:43<00:08,  8.69it/s]
 93%|█████████▎| 927/1000 [10:43<00:07,  9.64it/s]
 93%|█████████▎| 929/1000 [10:43<00:06, 10.48it/s]
 93%|█████████▎| 931/1000 [10:44<00:06, 11.12it/s]
 93%|█████████▎| 933/1000 [10:44<00:05, 11.63it/s]
 94%|█████████▎| 935/1000 [10:44<00:05, 11.96it/s]
 94%|█████████▎| 937/1000 [10:44<00:05, 12.35it/s]
 94%|█████████▍| 939/1000 [10:44<00:04, 12.58it/s]
 95%|█████████▍| 949/1000 [10:44<00:01, 30.73it/s]
 96%|█████████▌| 960/1000 [11:04<00:01, 30.73it/s]
 96%|█████████▌| 961/1000 [11:15<00:54,  1.39s/it]
 96%|█████████▌| 962/1000 [11:16<00:52,  1.37s/it]
 97%|█████████▋| 968/1000 [11:16<00:29,  1.10it/s]
 98%|█████████▊| 976/1000 [11:16<00:13,  1.80it/s]
 99%|█████████▉| 992/1000 [11:16<00:02,  3.76it/s]
100%|██████████| 1000/1000 [11:16<00:00,  1.48it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Maximum request concurrency:             128       
Benchmark duration (s):                  676.84    
Total input tokens:                      4135000   
Total generated tokens:                  2048000   
Request throughput (req/s):              1.48      
Output token throughput (tok/s):         3025.82   
Peak output token throughput (tok/s):    3456.00   
Peak concurrent requests:                143.00    
Total token throughput (tok/s):          9135.07   
---------------Time to First Token----------------
Mean TTFT (ms):                          40686.02  
Median TTFT (ms):                        43099.58  
P95 TTFT (ms):                           43838.20  
P99 TTFT (ms):                           46883.70  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.53     
Median TPOT (ms):                        20.68     
P95 TPOT (ms):                           20.97     
P99 TPOT (ms):                           21.04     
---------------Inter-token Latency----------------
Mean ITL (ms):                           27.69     
Median ITL (ms):                         19.03     
P95 ITL (ms):                            38.65     
P99 ITL (ms):                            151.92    
==================================================